# Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример:
# [2, 3, 4, 5, 6] => [12, 15, 16];
# [2, 3, 5, 6] => [12, 15]

arr = [2, 3, 4, 5, 6]
len_list = 0
if len(arr) % 2 == 0:
    len_list = len(arr) // 2
else:
    len_list = len(arr) // 2 + 1

for i in range(len_list):
    print(arr[i] * arr[len(arr) - i - 1])